dot_config/emacs/phil-emacs.org
# -*- mode: Org; org-use-property-inheritance: t; -*-
#+title: GNU Emacs configuration
#+author: Philippowitz
#+language: en
#+options: ':t toc:nil num:t author:t
#+PROPERTY: header-args :tangle "init.el"
#+STARTUP: overview
* Early Init
#+begin_src emacs-lisp :tangle "early-init.el"
    ;; -*- no-byte-compile: t; no-native-compile: t; no-update-autoloads: t; lexical-binding: t -*-
    (setq package-enable-at-startup nil)

    (setq frame-resize-pixelwise t)
    (setq frame-inhibit-implied-resize t)

    (menu-bar-mode -1) ;; disables menubar
    (tool-bar-mode -1) ;; disables toolbar
    (scroll-bar-mode -1) ;; disables scrollbar
    (tooltip-mode -1)
    (push '(menu-bar-lines . 0) default-frame-alist)
    (push '(tool-bar-lines . 0) default-frame-alist)
    (push '(vertical-scroll-bars) default-frame-alist)

  (setq scroll-conservatively 1000)

  (global-subword-mode 1)

  (setq-default sentence-end-double-space nil)

  (setq-default vc-follow-symlinks t)

    (recentf-mode 1)
    (electric-pair-mode 1)

    (defun efs/set-font-faces ()
      (message "Setting faces!")
      (set-face-attribute 'default nil :font "Iosevka Comfy" :height 100)

      ;; Set the fixed pitch face
      (set-face-attribute 'fixed-pitch nil :font "Iosevka Comfy" :height 100))

    (if (daemonp)
        (add-hook 'after-make-frame-functions
                  (lambda (frame)
                    (with-selected-frame frame
                      (efs/set-font-faces))))
      (efs/set-font-faces))
      ;;; early-init.el ends here
#+end_src

* Main Init
** Benchmark
#+begin_src emacs-lisp :tangle no
(add-to-list 'load-path "/home/phil/.config/emacs/benchmark-init-el/")
(require 'benchmark-init-loaddefs)
(benchmark-init/activate)
#+end_src

** Base emacs customisation
#+begin_src emacs-lisp
          ;; -*- no-byte-compile: t; no-native-compile: t; no-update-autoloads: t; lexical-binding: t -*-
          (setq gc-cons-threshold (* 50 1000 1000))
          (setq read-process-output-max (* 1024 1024)) ;; 1mb
          (setq init-start-time (current-time))
          (setq custom-file (make-temp-file "emacs-custom-"))
          (setq safe-local-variable-values '((org-use-property-inheritance . t)))
          (setq inhibit-splash-screen t ;; no thanks
                use-dialog-box nil
                use-file-dialog nil ;; don't use system file dialog
                tab-bar-new-button-show nil ;; don't show new tab button
                tab-bar-close-button-show nil ;; don't show tab close button
                tab-line-close-button-show nil ;; don't show tab close button
                tab-bar-show nil
                history-length 25
                pgtk-wait-for-event-timeout nil)

        (add-hook 'before-save-hook #'whitespace-cleanup)

          (when (native-comp-available-p)
            (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
            (setq native-compile-prune-cache t)) ; Emacs 29

      (setq-default indent-tabs-mode nil)

      (add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))

  (dolist (mode '(prog-mode-hook))
    (add-hook mode #'hs-minor-mode))

  (setq x-stretch-cursor t)


          ;; Disable line numbers for some modes
          (dolist (mode '(org-mode-hook
                          term-mode-hook
                          eshell-mode-hook))
            (add-hook mode (lambda () (display-line-numbers-mode))))

          (defun beginning-of-line-or-indentation ()
            "move to beginning of line, or indentation"
            (interactive)
            (if (bolp)
                (back-to-indentation)
              (beginning-of-line)))
          (define-key global-map (kbd "C-a") 'beginning-of-line-or-indentation)
#+end_src
[[https://stackoverflow.com/questions/28221079/ctrl-backspace-in-emacs-deletes-too-much][Backward Kill function]]
#+begin_src emacs-lisp
  (defun phil/backward-kill-word ()
    "Remove all whitespace if the character behind the cursor is whitespace, otherwise remove a word."
    (interactive)
    (if (looking-back "[ \n]")
        ;; delete horizontal space before us and then check to see if we
        ;; are looking at a newline
        (progn (delete-horizontal-space 't)
               (while (looking-back "[ \n]")
                 (backward-delete-char 1)))
      ;; otherwise, just do the normal kill word.
      (backward-kill-word 1)))

  (global-set-key  [C-backspace]
                   'phil/backward-kill-word)

  (defun prot-simple-keyboard-quit-dwim ()
    "Do-What-I-Mean behaviour for a general `keyboard-quit'.

  The generic `keyboard-quit' does not do the expected thing when
  the minibuffer is open.  Whereas we want it to close the
  minibuffer, even without explicitly focusing it.

  The DWIM behaviour of this command is as follows:

  - When the region is active, disable it.
  - When a minibuffer is open, but not focused, close the minibuffer.
  - When the Completions buffer is selected, close it.
  - In every other case use the regular `keyboard-quit'."
    (interactive)
    (cond
     ((region-active-p)
      (keyboard-quit))
     ((derived-mode-p 'completion-list-mode)
      (delete-completion-window))
     ((> (minibuffer-depth) 0)
      (abort-recursive-edit))
     (t
      (keyboard-quit))))

  (global-set-key  (kbd "C-g")
                   'prot-simple-keyboard-quit-dwim)



  (setq major-mode-remap-alist
        '((yaml-mode . yaml-ts-mode)
          (bash-mode . bash-ts-mode)
          (java-mode . java-ts-mode)
          (js2-mode . js-ts-mode)
          (typescript-mode . typescript-ts-mode)
          (json-mode . json-ts-mode)
          (css-mode . css-ts-mode)
          (python-mode . python-ts-mode)))

  (load-theme 'modus-operandi)
#+end_src
