dot_config/emacs/init.el
;; -*- no-byte-compile: t; no-native-compile: t; no-update-autoloads: t; lexical-binding: t -*-
        (setq gc-cons-threshold (* 50 1000 1000))
        (setq read-process-output-max (* 1024 1024)) ;; 1mb
        (setq init-start-time (current-time))
        (setq custom-file (make-temp-file "emacs-custom-"))
        (setq safe-local-variable-values '((org-use-property-inheritance . t)))
        (setq inhibit-splash-screen t ;; no thanks
              use-dialog-box nil
              use-file-dialog nil ;; don't use system file dialog
              tab-bar-new-button-show nil ;; don't show new tab button
              tab-bar-close-button-show nil ;; don't show tab close button
              tab-line-close-button-show nil ;; don't show tab close button
              tab-bar-show nil
              history-length 25
              pgtk-wait-for-event-timeout nil)

      (add-hook 'before-save-hook #'whitespace-cleanup)

        (when (native-comp-available-p)
          (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
          (setq native-compile-prune-cache t)) ; Emacs 29

    (setq-default indent-tabs-mode nil)

    (add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))

(dolist (mode '(prog-mode-hook))
  (add-hook mode #'hs-minor-mode))

(setq x-stretch-cursor t)


        ;; Disable line numbers for some modes
        (dolist (mode '(org-mode-hook
                        term-mode-hook
                        eshell-mode-hook))
          (add-hook mode (lambda () (display-line-numbers-mode))))

        (defun beginning-of-line-or-indentation ()
          "move to beginning of line, or indentation"
          (interactive)
          (if (bolp)
              (back-to-indentation)
            (beginning-of-line)))
        (define-key global-map (kbd "C-a") 'beginning-of-line-or-indentation)

(defun phil/backward-kill-word ()
  "Remove all whitespace if the character behind the cursor is whitespace, otherwise remove a word."
  (interactive)
  (if (looking-back "[ \n]")
      ;; delete horizontal space before us and then check to see if we
      ;; are looking at a newline
      (progn (delete-horizontal-space 't)
             (while (looking-back "[ \n]")
               (backward-delete-char 1)))
    ;; otherwise, just do the normal kill word.
    (backward-kill-word 1)))

(global-set-key  [C-backspace]
                 'phil/backward-kill-word)

(defun prot-simple-keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(global-set-key  (kbd "C-g")
                 'prot-simple-keyboard-quit-dwim)



(setq major-mode-remap-alist
      '((yaml-mode . yaml-ts-mode)
        (bash-mode . bash-ts-mode)
        (java-mode . java-ts-mode)
        (js2-mode . js-ts-mode)
        (typescript-mode . typescript-ts-mode)
        (json-mode . json-ts-mode)
        (css-mode . css-ts-mode)
        (python-mode . python-ts-mode)))

(load-theme 'modus-operandi)
