dot_config/emacs/phil-emacs.org
** Elpaca Bootstrap
#+begin_src emacs-lisp
    (defvar elpaca-installer-version 0.10)
    (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
    (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
    (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
    (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                  :ref nil :depth 1 :inherit ignore
                                  :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                  :build (:not elpaca--activate-package)))
    (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
           (build (expand-file-name "elpaca/" elpaca-builds-directory))
           (order (cdr elpaca-order))
           (default-directory repo))
      (add-to-list 'load-path (if (file-exists-p build) build repo))
      (unless (file-exists-p repo)
        (make-directory repo t)
        (when (<= emacs-major-version 28) (require 'subr-x))
        (condition-case-unless-debug err
            (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                      ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                      ,@(when-let* ((depth (plist-get order :depth)))
                                                          (list (format "--depth=%d" depth) "--no-single-branch"))
                                                      ,(plist-get order :repo) ,repo))))
                      ((zerop (call-process "git" nil buffer t "checkout"
                                            (or (plist-get order :ref) "--"))))
                      (emacs (concat invocation-directory invocation-name))
                      ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                            "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                      ((require 'elpaca))
                      ((elpaca-generate-autoloads "elpaca" repo)))
                (progn (message "%s" (buffer-string)) (kill-buffer buffer))
              (error "%s" (with-current-buffer buffer (buffer-string))))
          ((error) (warn "%s" err) (delete-directory repo 'recursive))))
      (unless (require 'elpaca-autoloads nil t)
        (require 'elpaca)
        (elpaca-generate-autoloads "elpaca" repo)
        (load "./elpaca-autoloads")))
    (add-hook 'after-init-hook #'elpaca-process-queues)
    (elpaca `(,@elpaca-order))

    (elpaca elpaca-use-package
      ;; Enable use-package :ensure support for Elpaca.
      (elpaca-use-package-mode))
      (elpaca-wait)
      (use-package no-littering :ensure (:wait t)
        :config
        (no-littering-theme-backups))
#+end_src
** Experimental Org Branch
#+begin_src emacs-lisp
  (use-package org
    :ensure `(org :repo "https://code.tecosaur.net/tec/org-mode.git/"
                            :branch "dev" :wait t)
    :defer t
    :config
    (add-to-list 'org-latex-packages-alist '("" "akkmathset" t))
        (add-to-list 'org-latex-packages-alist '("" "mathtools" t))
    (setq org-startup-indented t)
    (setq org-M-RET-may-split-line '((default . nil)))
    (setq org-insert-heading-respect-content t)
    (setq org-use-property-inheritance t))
#+end_src
** History
#+begin_src emacs-lisp
  (use-package savehist
    :init
    (savehist-mode 1))
#+end_src
** More emacs customisation
#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :init
    (setopt use-short-answers t)
    (set-face-attribute 'default nil
                        :font "Iosevka Comfy"
                        :height 100)

    (defun ab/enable-line-numbers ()
      "Enable relative line numbers"
      (interactive)
      (display-line-numbers-mode)
      (setq display-line-numbers 'relative))
    (add-hook 'prog-mode-hook #'ab/enable-line-numbers)
    (add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)

    (setq initial-scratch-message nil)
    (defun display-startup-echo-area-message ()
      (message ""))
    (set-charset-priority 'unicode)
    (setq locale-coding-system 'utf-8
          coding-system-for-read 'utf-8
          coding-system-for-write 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)
    (setq default-process-coding-system '(utf-8-unix . utf-8-unix))
    (setq-default indent-tabs-mode nil)
    (setq-default tab-width 2)
    :custom
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    (read-extended-command-predicate #'command-completion-default-include-p)
    ;; TAB cycle if there are only few candidates
    ;; (completion-cycle-threshold 3)

    (tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function.
    ;; Try `cape-dict' as an alternative.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p)

    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))

  (defun efs/display-startup-time ()
      (let ((init-time (float-time (time-subtract (current-time) init-start-time)))
        (total-time (string-to-number (emacs-init-time "%f"))))
    (message (concat
      "Startup time: "
      (format "%.2fs " init-time)
      (format "(+ %.2fs system time)"
                          (- total-time init-time))))))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src
** Project.el
Add ability for project el to recognise projects by adding a .projectile to the root folder
#+begin_src emacs-lisp
(defun ct/dir-contains-project-marker (dir)
  "Checks if `.project' file is present in directory at DIR path."
  (let ((project-marker-path (file-name-concat dir ".projectile")))
    (when (file-exists-p project-marker-path)
       (cons 'transient dir))))

(customize-set-variable 'project-find-functions
                        (list #'project-try-vc
                              #'ct/dir-contains-project-marker))
#+end_src
** Load Modules
#+begin_src emacs-lisp
  (let ((default-directory (locate-user-emacs-file "local-modules/")))
    (normal-top-level-add-subdirs-to-load-path))

  (setenv "SHELL" "/bin/bash")
  (setq explicit-shell-file-name "/bin/bash")

  (use-package on
    :ensure
    (:host gitlab :repo "axgfn/on.el"))

  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (daemonp)
      (exec-path-from-shell-initialize)))
#+end_src
** Custom Funs
#+begin_src emacs-lisp
  (defun my-md-to-org-region (start end)
  "Convert region from markdown to org"
  (interactive "r")
  (shell-command-on-region start end "pandoc -f markdown -t org" t t))
#+end_src
** Treesitter
#+begin_src emacs-lisp
  (use-package treesit-auto
    :ensure t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src
* Modules
