dot_config/emacs/phil-emacs.org
** Meow
#+begin_src emacs-lisp :tangle no
    (use-package meow
    :ensure t
    :config
    (defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
  (meow-leader-define-key
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))
  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-find)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))
    (meow-global-mode 1)
  )
#+end_src
** Workspaces
#+begin_src emacs-lisp
  (use-package tabspaces
    :ensure t
    :commands (tabspaces-switch-or-create-workspace
               tabspaces-open-or-create-project-and-workspace)
    :bind
    ("<C-tab>" . tabspaces-switch-or-create-workspace)
    :custom
    (tabspaces-use-filtered-buffers-as-default t)
    (tabspaces-default-tab "Default")
    (tabspaces-remove-to-default t)
    (tabspaces-include-buffers '("*scratch*"))
    (tabspaces-initialize-project-with-todo t)
    (tabspaces-todo-file-name "project-todo.org")
    ;; sessions
    (tabspaces-session t)
    (tabspaces-session-auto-restore nil)
    (tab-bar-new-tab-choice "*scratch*")
    (tabspaces-keymap-prefix "C-x t")
    (defvar tabspaces-command-map
      (let ((map (make-sparse-keymap)))
        (define-key map (kbd "C") 'tabspaces-clear-buffers)
        (define-key map (kbd "b") 'tabspaces-switch-to-buffer)
        (define-key map (kbd "d") 'tabspaces-close-workspace)
        (define-key map (kbd "k") 'tabspaces-kill-buffers-close-workspace)
        (define-key map (kbd "o") 'tabspaces-open-or-create-project-and-workspace)
        (define-key map (kbd "r") 'tabspaces-remove-current-buffer)
        (define-key map (kbd "R") 'tabspaces-remove-selected-buffer)
        (define-key map (kbd "s") 'tabspaces-switch-or-create-workspace)
        (define-key map (kbd "t") 'tabspaces-switch-buffer-and-tab)
        map)
      "Keymap for tabspace/workspace commands after `tabspaces-keymap-prefix'.")
      :config
      ;; Tabspace integration
      (with-eval-after-load 'consult
        ;; hide full buffer list (still available with "b" prefix)
        (consult-customize consult--source-buffer :hidden t :default nil)
        ;; set consult-workspace buffer list
        (defvar consult--source-workspace
          (list :name     "Workspace Buffers"
                :narrow   ?w
                :history  'buffer-name-history
                :category 'buffer
                :state    #'consult--buffer-state
                :default  t
                :items    (lambda () (consult--buffer-query
                                      :predicate #'tabspaces--local-buffer-p
                                      :sort 'visibility
                                      :as #'buffer-name)))

          "Set workspace buffer list for consult-buffer.")
        (add-to-list 'consult-buffer-sources 'consult--source-workspace)))
#+end_src
** Appearance
#+begin_src emacs-lisp
      (use-package which-key
        :init (which-key-mode)
        :diminish which-key-mode)

      (use-package nerd-icons
        :defer t
        :ensure t)

      (use-package emojify
        :ensure t
        :hook (on-first-buffer . global-emojify-mode))

      (use-package rainbow-delimiters
        :ensure t
        :hook (prog-mode . rainbow-delimiters-mode))

      (use-package spacious-padding
        :ensure t
        :init
        (setq spacious-padding-widths
          '( :internal-border-width 10
             :header-line-width -4
             :mode-line-width -4
             :tab-width 4
             :right-divider-width 20
             :scroll-bar-width 4
             :fringe-width 8))
        (spacious-padding-mode))

  (use-package pixel-scroll
    :ensure nil
    :bind
    ([remap scroll-up-command]   . pixel-scroll-interpolate-down)
    ([remap scroll-down-command] . pixel-scroll-interpolate-up)
    :custom
    (pixel-scroll-precision-interpolate-page t))


      (use-package casual-suite
        :ensure t
        :defer t
        :bind (("M-g" . casual-avy-tmenu)
               ("M-o" . casual-editkit-main-tmenu))
        :hook   (calc-mode . (lambda () (keymap-set calc-mode-map "M-o" #'casual-calc-tmenu)))
        (dired-mode . (lambda () (keymap-set dired-mode-map "M-o" #'casual-dired-tmenu)))
        (isearch-mode . (lambda () (keymap-set isearch-mode-map "M-o" #'casual-isearch-tmenu)))
        (ibuffer-mode . (lambda ()
                          (keymap-set ibuffer-mode-map "M-o" #'casual-ibuffer-tmenu)
                          (keymap-set ibuffer-mode-map "F" #'casual-ibuffer-filter-tmenu)
                          (keymap-set ibuffer-mode-map "s" #'casual-ibuffer-sortby-tmenu)))
        (Info-mode . (lambda () (keymap-set Info-mode-map "M-o" #'casual-info-tmenu)))
        (reb-mode . (lambda () (keymap-set reb-mode-map "M-o" #'casual-re-builder-tmenu)))
        (reb-lisp-mode . (lambda () (keymap-set reb-lisp-mode-map "M-o" #'casual-re-builder-tmenu)))
        (bookmark-bmenu-mode . (lambda () (keymap-set bookmark-bmenu-mode-map "M-o" #'casual-bookmarks-tmenu)))
        (org-agenda-mode . (lambda () (keymap-set org-agenda-mode-map "M-o" #'casual-agenda-tmenu)))
        (symbol-overlay-mode . (lambda () (keymap-set symbol-overlay-map "M-o" #'casual-symbol-overlay-tmenu))))
#+end_src
** Keybindings
#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t
    :bind
    ("M-o" . ace-window)
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src
** Dirvish
#+begin_src emacs-lisp :tangle no
  (use-package dirvish
    :ensure t
    :init
    (dirvish-override-dired-mode)
    :config
    (dirvish-peek-mode) ; Preview files in minibuffer

    (setq dirvish-mode-line-format
          '(:left (sort symlink) :right (omit yank index)))
    (setq dirvish-attributes
          '(nerd-icons file-time file-size collapse subtree-state vc-state git-msg))
    (setq dirvish-subtree-state-style 'nerd)
    (setq delete-by-moving-to-trash t)
    (setq dirvish-path-separators (list
                                   (format "  %s " (nerd-icons-codicon "nf-cod-home"))
                                   (format "  %s " (nerd-icons-codicon "nf-cod-root_folder"))
                                   (format " %s " (nerd-icons-faicon "nf-fa-angle_right"))))
    (dirvish-side-follow-mode) ; similar to `treemacs-follow-mode'
    (setq dired-listing-switches
          "-l --almost-all --human-readable --group-directories-first --no-group")
    :bind ; Bind `dirvish|dirvish-side|dirvish-dwim' as you see fit
    (("C-c f" . dirvish-fd)
     :map dirvish-mode-map ; Dirvish inherits `dired-mode-map'
     ("a"   . dirvish-quick-access)
     ("f"   . dirvish-file-info-menu)
     ("y"   . dirvish-yank-menu)
     ("N"   . dirvish-narrow)
     ("^"   . dirvish-history-last)
     ("h"   . dirvish-history-jump) ; remapped `describe-mode'
     ("s"   . dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
     ("v"   . dirvish-vc-menu)      ; remapped `dired-view-file'
     ("TAB" . dirvish-subtree-toggle)
     ("M-f" . dirvish-history-go-forward)
     ("M-b" . dirvish-history-go-backward)
     ("M-l" . dirvish-ls-switches-menu)
     ("M-m" . dirvish-mark-menu)
     ("M-t" . dirvish-layout-toggle)
     ("M-s" . dirvish-setup-menu)
     ("M-e" . dirvish-emerge-menu)
     ("M-j" . dirvish-fd-jump)))
#+end_src
