dot_config/emacs/init.el

(use-package tabspaces
  :ensure t
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :bind
  ("<C-tab>" . tabspaces-switch-or-create-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))
  (tabspaces-initialize-project-with-todo t)
  (tabspaces-todo-file-name "project-todo.org")
  ;; sessions
  (tabspaces-session t)
  (tabspaces-session-auto-restore nil)
  (tab-bar-new-tab-choice "*scratch*")
  (tabspaces-keymap-prefix "C-x t")
  (defvar tabspaces-command-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "C") 'tabspaces-clear-buffers)
      (define-key map (kbd "b") 'tabspaces-switch-to-buffer)
      (define-key map (kbd "d") 'tabspaces-close-workspace)
      (define-key map (kbd "k") 'tabspaces-kill-buffers-close-workspace)
      (define-key map (kbd "o") 'tabspaces-open-or-create-project-and-workspace)
      (define-key map (kbd "r") 'tabspaces-remove-current-buffer)
      (define-key map (kbd "R") 'tabspaces-remove-selected-buffer)
      (define-key map (kbd "s") 'tabspaces-switch-or-create-workspace)
      (define-key map (kbd "t") 'tabspaces-switch-buffer-and-tab)
      map)
    "Keymap for tabspace/workspace commands after `tabspaces-keymap-prefix'.")
    :config
    ;; Tabspace integration
    (with-eval-after-load 'consult
      ;; hide full buffer list (still available with "b" prefix)
      (consult-customize consult--source-buffer :hidden t :default nil)
      ;; set consult-workspace buffer list
      (defvar consult--source-workspace
        (list :name     "Workspace Buffers"
              :narrow   ?w
              :history  'buffer-name-history
              :category 'buffer
              :state    #'consult--buffer-state
              :default  t
              :items    (lambda () (consult--buffer-query
                                    :predicate #'tabspaces--local-buffer-p
                                    :sort 'visibility
                                    :as #'buffer-name)))

        "Set workspace buffer list for consult-buffer.")
      (add-to-list 'consult-buffer-sources 'consult--source-workspace)))

(use-package which-key
      :init (which-key-mode)
      :diminish which-key-mode)

    (use-package nerd-icons
      :defer t
      :ensure t)

    (use-package emojify
      :ensure t
      :hook (on-first-buffer . global-emojify-mode))

    (use-package rainbow-delimiters
      :ensure t
      :hook (prog-mode . rainbow-delimiters-mode))

    (use-package spacious-padding
      :ensure t
      :init
      (setq spacious-padding-widths
        '( :internal-border-width 10
           :header-line-width -4
           :mode-line-width -4
           :tab-width 4
           :right-divider-width 20
           :scroll-bar-width 4
           :fringe-width 8))
      (spacious-padding-mode))

(use-package pixel-scroll
  :ensure nil
  :bind
  ([remap scroll-up-command]   . pixel-scroll-interpolate-down)
  ([remap scroll-down-command] . pixel-scroll-interpolate-up)
  :custom
  (pixel-scroll-precision-interpolate-page t))


    (use-package casual-suite
      :ensure t
      :defer t
      :bind (("M-g" . casual-avy-tmenu)
             ("M-o" . casual-editkit-main-tmenu))
      :hook   (calc-mode . (lambda () (keymap-set calc-mode-map "M-o" #'casual-calc-tmenu)))
      (dired-mode . (lambda () (keymap-set dired-mode-map "M-o" #'casual-dired-tmenu)))
      (isearch-mode . (lambda () (keymap-set isearch-mode-map "M-o" #'casual-isearch-tmenu)))
      (ibuffer-mode . (lambda ()
                        (keymap-set ibuffer-mode-map "M-o" #'casual-ibuffer-tmenu)
                        (keymap-set ibuffer-mode-map "F" #'casual-ibuffer-filter-tmenu)
                        (keymap-set ibuffer-mode-map "s" #'casual-ibuffer-sortby-tmenu)))
      (Info-mode . (lambda () (keymap-set Info-mode-map "M-o" #'casual-info-tmenu)))
      (reb-mode . (lambda () (keymap-set reb-mode-map "M-o" #'casual-re-builder-tmenu)))
      (reb-lisp-mode . (lambda () (keymap-set reb-lisp-mode-map "M-o" #'casual-re-builder-tmenu)))
      (bookmark-bmenu-mode . (lambda () (keymap-set bookmark-bmenu-mode-map "M-o" #'casual-bookmarks-tmenu)))
      (org-agenda-mode . (lambda () (keymap-set org-agenda-mode-map "M-o" #'casual-agenda-tmenu)))
      (symbol-overlay-mode . (lambda () (keymap-set symbol-overlay-map "M-o" #'casual-symbol-overlay-tmenu))))

(use-package ace-window
  :ensure t
  :bind
  ("M-o" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
