dot_config/emacs/init.el

(use-package undo-fu
  :ensure t
  :config
  (setq undo-limit 400000           ; 400kb (default is 160kb)
        undo-strong-limit 3000000   ; 3mb   (default is 240kb)
        undo-outer-limit 48000000)  ; 48mb  (default is 24mb)

  ;; Keybindings
  (global-set-key [remap undo] #'undo-fu-only-undo)
  (global-set-key [remap redo] #'undo-fu-only-redo)
  (global-set-key (kbd "C-_")     #'undo-fu-only-undo)
  (global-set-key (kbd "M-_")     #'undo-fu-only-redo)
  (global-set-key (kbd "C-M-_")   #'undo-fu-only-redo-all)
  (global-set-key (kbd "C-x r u") #'undo-fu-session-save)
  (global-set-key (kbd "C-x r U") #'undo-fu-session-recover))

(use-package undo-fu-session
  :ensure t
  :config
  (when (executable-find "zstd")
    (setq undo-fu-session-compression 'zst))
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  (undo-fu-session-global-mode 1)
  :custom
  (undo-fu-session-directory (concat no-littering-var-directory "undo-fu-session/")))

  (use-package vundo
    :ensure t
    :defer t
    :bind ("C-x u" . vundo))

(use-package vertico
  :ensure t
  :hook (on-first-input . vertico-mode)
  :custom
  ;; (vertico-scroll-margin 0) ;; Different scroll margin
  ;; (vertico-count 20) ;; Show more candidates
  (vertico-resize nil) ;; Grow and shrink the Vertico minibuffer
  (vertico-cycgle t) ;; Enable cycling for `vertico-next/previous'
  )

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("C-DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package marginalia
  :ensure t
  :after vertico
  :config
  (marginalia-mode))

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package corfu
    :ensure t
    :hook (on-first-input . global-corfu-mode)
    :bind
    (:map corfu-map
          ("C-n" . corfu-next)
          ("C-p" . corfu-previous)
          ("M-n". corfu-popupinfo-scroll-down)
          ("M-p". corfu-popupinfo-scroll-up))
    :config
    (setq tab-always-indent 'complete)
    (setq corfu-preview-current nil)
    (setq corfu-min-width 20)

     (setq corfu-auto t
          corfu-cycle t
          corfu-preselect 'prompt
          corfu-count 16
          corfu-max-width 120)

    (with-eval-after-load 'savehist
      (corfu-history-mode 1)
      (add-to-list 'savehist-additional-variables 'corfu-history))
)

(use-package cape
:after corfu
:ensure t
;; Bind prefix keymap providing all Cape commands under a mnemonic key.
;; Press C-c p ? to for help.
;; :bind ("M-p" . cape-prefix-map) ;; Alternative key: M-<tab>, M-p, M-+
;; Alternatively bind Cape commands individually.
;; :bind (("C-c p d" . cape-dabbrev)
;;        ("C-c p h" . cape-history)
;;        ("C-c p f" . cape-file)
;;        ...)
:init
;; Add to the global default value of `completion-at-point-functions' which is
;; used by `completion-at-point'.  The order of the functions matters, the
;; first function returning a result wins.  Note that the list of buffer-local
;; completion functions takes precedence over the global list.
(defun my/eglot-capf ()
(setq-local completion-at-point-functions
            (list (cape-capf-super
                   #'eglot-completion-at-point
                   #'cape-file))))

(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
(add-hook 'completion-at-point-functions #'cape-dabbrev)
(add-hook 'completion-at-point-functions #'cape-file)
(add-hook 'completion-at-point-functions #'cape-elisp-block)

(add-hook 'completion-at-point-functions #'cape-history))
