dot_config/emacs/phil-emacs.org
*** Completions
#+begin_src emacs-lisp
  (use-package fussy
    :defer t
    :ensure
    (:host github :repo "jojojames/fussy")
    :config
    (setq fussy-use-cache t)
    (setq fussy-compare-same-score-fn 'fussy-histlen->strlen<)
    (fussy-setup))

  ;; (use-package fzf-native
  ;;   :ensure
  ;;   (fzf-native :repo "dangduc/fzf-native" :host github :files (:defaults "*.c" "*.h" "*.txt"))
  ;;   :init
  ;;   (setq fzf-native-always-compile-module t)
  ;;   :config
  ;;   (setq fussy-score-fn 'fussy-fzf-native-score)
  ;;   (fzf-native-load-own-build-dyn))

  (use-package orderless
    :ensure t
    :custom
    ;; (orderless-style-dispatchers '(orderless-affix-dispatch))
    ;; (orderless-component-separator #'orderless-escapable-split-on-space)
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))

  ;; Example configuration for Consult
  (use-package consult
    ;; Replace bindings. Lazily loaded by `use-package'.
    :bind (;; C-c bindings in `mode-specific-map'
           ("C-c M-x" . consult-mode-command)
           ("C-c h" . consult-history)
           ("C-c k" . consult-kmacro)
           ("C-c m" . consult-man)
           ("C-c i" . consult-info)
           ([remap Info-search] . consult-info)
           ;; C-x bindings in `ctl-x-map'
           ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
           ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
           ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
           ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
           ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
           ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
           ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
           ;; Custom M-# bindings for fast register access
           ("M-#" . consult-register-load)
           ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
           ("C-M-#" . consult-register)
           ;; Other custom bindings
           ("M-y" . consult-yank-pop)                ;; orig. yank-pop
           ;; M-g bindings in `goto-map'
           ("M-g e" . consult-compile-error)
           ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
           ("M-g g" . consult-goto-line)             ;; orig. goto-line
           ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
           ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
           ("M-g m" . consult-mark)

           ("M-g i" . consult-imenu)
           ("M-g I" . consult-imenu-multi)
           ;; M-s bindings in `search-map'
           ("M-s d" . consult-find)                  ;; Alternative: consult-fd
           ("M-s c" . consult-locate)
           ("M-s g" . consult-grep)
           ("M-s G" . consult-git-grep)
           ("M-s r" . consult-ripgrep)
           ("M-s l" . consult-line)
           ("M-s L" . consult-line-multi)
           ("M-s k" . consult-keep-lines)
           ("M-s u" . consult-focus-lines)
           ;; Isearch integration
           ("M-s e" . consult-isearch-history)
           :map isearch-mode-map
           ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
           ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
           ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
           ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
           ;; Minibuffer history
           :map minibuffer-local-map
           ("M-s" . consult-history)                 ;; orig. next-matching-history-element
           ("M-r" . consult-history))                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    :init
    (advice-add #'register-preview :override #'consult-register-window)
    (setq register-preview-delay 0.5)

    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :config
    (setq consult-preview-key "M-.")
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep consult-man
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     )
    )


  (use-package consult-project-extra
    :ensure t
    :after consult
    :bind
    (("C-c p f" . consult-project-extra-find)
     ("C-c p o" . consult-project-extra-find-other-window)))

  (use-package embark
    :defer t
    :ensure t
    :bind (("C-." . embark-act)
           :map minibuffer-local-map
           ("C-c C-c" . embark-collect)
           ("C-c C-e" . embark-export)))

  (use-package embark-consult
    :after embark
    :ensure t)

  (use-package wgrep
    :defer t
    :ensure t
    :bind ( :map grep-mode-map
            ("e" . wgrep-change-to-wgrep-mode)
            ("C-x C-q" . wgrep-change-to-wgrep-mode)
            ("C-c C-c" . wgrep-finish-edit)))

#+end_src
** Snippets
*** Yasnippet
#+begin_src emacs-lisp :tangle no
  (use-package yasnippet
    :ensure t
    :hook (on-first-input . yas-global-mode))

  (use-package yasnippet-snippets
    :ensure t)
#+End_src
*** Tempel
#+begin_src emacs-lisp
      ;; Configure Tempel
    (use-package tempel
      :ensure t
      ;; Require trigger prefix before template name when completing.
      ;; :custom
      ;; (tempel-trigger-prefix "<")
      :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
             ("M-*" . tempel-insert))
      :init
      (defun tempel-setup-capf ()
        ;; Add the Tempel Capf to `completion-at-point-functions'.
        ;; `tempel-expand' only triggers on exact matches. Alternatively use
        ;; `tempel-complete' if you want to see all matches, but then you
        ;; should also configure `tempel-trigger-prefix', such that Tempel
        ;; does not trigger too often when you don't expect it. NOTE: We add
        ;; `tempel-expand' *before* the main programming mode Capf, such
        ;; that it will be tried first.
        (setq-local completion-at-point-functions
                    (cons #'tempel-expand
                          completion-at-point-functions)))
      (add-hook 'conf-mode-hook 'tempel-setup-capf)
      (add-hook 'prog-mode-hook 'tempel-setup-capf)
      (add-hook 'text-mode-hook 'tempel-setup-capf)

      ;; Optionally make the Tempel templates available to Abbrev,
      ;; either locally or globally. `expand-abbrev' is bound to C-x '.
      ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
      ;; (global-tempel-abbrev-mode)
    )

    ;; Optional: Add tempel-collection.
    ;; The package is young and doesn't have comprehensive coverage.
    (use-package tempel-collection
      :ensure t
      :after tempel)
#+end_src
*** Auto Activating Snippets
#+begin_src emacs-lisp
  (use-package laas
    :ensure t
    :hook (org-mode . laas-mode)
    :config ; do whatever here
    (aas-set-snippets 'laas-mode
      ;; set condition!
      :cond #'texmathp ; expand only while in math
      "supp" "\\supp"
      "On" "O(n)"
      "O1" "O(1)"
      "Olog" "O(\\log n)"
      "Olon" "O(n \\log n)"
      ;; bind to functions!
      "Sum" (lambda () (interactive)
              (tempel-insert ("\\sum_{"p"}^{"p"}" p)))

      "Sca" (lambda () (interactive)
              (tempel-insert ("\\langle " p"," p "\\rangle " p)))
      "Span" (lambda () (interactive)
               (tempel-insert ("\\Span("p") " p)))
      ;; add accent snippets
      :cond #'laas-object-on-left-condition
      "qq" (lambda () (interactive) (laas-wrap-previous-object "sqrt"))
      "'e" (lambda () (interactive) (laas-wrap-previous-object "mathbb"))
      ))
#+end_src
** Org Mode
