dot_config/emacs/init.el

(setq org-agenda-files '("~/org/"))
(setq org-directory "~/org/")

(use-package cdlatex
  :ensure t
  :custom
  (cdlatex-math-modify-prefix [f7])
  (cdlatex-math-symbol-prefix [f8])
  :hook (org-mode . org-cdlatex-mode))

(use-package org
  :ensure nil
  :config
  (define-key org-cdlatex-mode-map (kbd "'") nil)
  :bind
  ("C-c a" . org-agenda))

(use-package org-download
  :ensure t
  :hook (org-mode . org-download-enable)
  :config
  (setq org-download-link-format "[[file:%s]]\n"
        org-download-abbreviate-filename-function #'file-relative-name)
  (setq org-download-link-format-function #'org-download-link-format-function-default))


(use-package org-latex-preview
  :defer t
  :hook (org-mode . org-latex-preview-auto-mode)
  :config
  ;; Increase preview width
  (plist-put org-latex-preview-appearance-options
             :page-width 0.8)
  ;; Use dvisvgm to generate previews
  ;; You don't need this, it's the default:
  (setq org-latex-preview-process-default 'dvisvgm)

  ;; Turn on auto-mode, it's built into Org and much faster/more featured than
  ;; org-fragtog. (Remember to turn off/uninstall org-fragtog.)
  ;; (add-hook 'org-mode-hook 'org-latex-preview-auto-mode)

  ;; Block C-n, C-p etc from opening up previews when using auto-mode
  (setq org-latex-preview-auto-ignored-commands
        '(next-line previous-line mwheel-scroll
                    scroll-up-command scroll-down-command))

  ;; Enable consistent equation numbering
  (setq org-latex-preview-numbered t)

  ;; Bonus: Turn on live previews.  This shows you a live preview of a LaTeX
  ;; fragment and updates the preview in real-time as you edit it.
  ;; To preview only environments, set it to '(block edit-special) instead
  (setq org-latex-preview-live t)

  ;; More immediate live-previews -- the default delay is 1 second
  (setq org-latex-preview-live-debounce 0.25))

(use-package ox
  :after ox-latex
  :config
