dot_config/emacs/init.el
  ;; Add custom LaTeX class
  (add-to-list 'org-latex-classes
                   '("Ausbildungsnachweis" "\\documentclass[a4paper, 12pt]{letter}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
[EXTRA]"
                     ("\\section{%s}" . "\\section*{%s}")
                     ("\\subsection{%s}" . "\\subsection*{%s}")))

  ;; Define the custom backend
  (org-export-define-derived-backend 'ausbildungsnachweis 'latex
    :options-alist
    '((:trainyear "TRAINYEAR" nil nil)          ;; Extract #+FROM: keyword
      (:traino "TRAINNO" nil nil) ;; Extract #+DEPARTMENT: keyword
      (:timeframe "TIMEFRAME" nil nil) ;; Extract #+DEPARTMENT: keyword
      (:institute "INSTITUTE" nil nil)) ;; Extract #+DEPARTMENT: keyword
    :translate-alist '((template . ausbildungsnachweis-template))
    :menu-entry
    '(?A "Export with Ausbildungsnachweis"
         ((?L "As LaTeX buffer" ausbildungsnachweis-export-as-latex)
          (?l "As LaTeX file" ausbildungsnachweis-export-to-latex)
          (?p "As PDF file" ausbildungsnachweis-export-to-pdf)
          (?o "As PDF file and open"
              (lambda (a s v b)
                (if a (ausbildungsnachweis-export-to-pdf t s v b)
                  (org-open-file (ausbildungsnachweis-export-to-pdf nil s v b))))))))

  (defun ausbildungsnachweis-template (contents info)
    "Return complete document string after LaTeX conversion.
CONTENTS is the transcoded contents string.  INFO is a plist
holding export options."
    (let ((title (org-export-data (plist-get info :title) info))
              (spec (org-latex--format-spec info))
          (trainyear(org-export-data (plist-get info :trainyear) info))
          (traino (org-export-data (plist-get info :traino) info))
          (timeframe (org-export-data (plist-get info :timeframe) info))
          (institute (org-export-data (plist-get info :institute) info)))
      (concat
       ;; Timestamp.
       (and (plist-get info :time-stamp-file)
                (format-time-string "%% Created %Y-%m-%d %a %H:%M\n"))
       ;; LaTeX compiler.
       (org-latex--insert-compiler info)
       ;; Document class and packages.
       (org-latex-make-preamble info)
       "
\\usepackage{lmodern}
\\usepackage{fancyhdr}
\\usepackage[stretch=10]{microtype}
\\usepackage{array}
\\usepackage{booktabs}
\\usepackage{tabularx}
\\usepackage{geometry}
\\usepackage{eforms}
\\usepackage[parfill]{parskip}

\\renewcommand{\\baselinestretch}{1.15}
\\geometry{a4paper, margin=1in}
\\pagestyle{fancy}
\\fancyhf{}  % Clear default header/footer
\\fancyhead[C]{Ausbildung Mathematisch-technischer Softwareentwickler an der Universität zu Köln}  % Left header
\\fancyfoot[C]{\\thepage}  % Centered page number in the footer
\\renewcommand{\\arraystretch}{2}

\\makeatletter
\\def\\institute#1{\\gdef\\@institute{#1}}
\\def\\timeframe#1{\\gdef\\@timeframe{#1}}
\\def\\trainno#1{\\gdef\\@trainno{#1}}
\\def\\trainyear#1{\\gdef\\@trainyear{#1}}
\\renewcommand{\\maketitle}{
  \\begin{center} {
    \\Large \\textbf{Ausbildungsnachweis}} \\\\[1em]
  \\end{center} \\vspace{1em}
  \\begin{tabularx}{\\textwidth}{X X }
    \\textbf{Author:} \\@author & \\textbf{Institut:} \\@institute \\\\
    \\textbf{Berichtszeitraum:} \\@timeframe  & \\textbf{Ausbildungsnachweis Nr.:}  \\@trainno \\\\
    \\textbf{Ausbildungsjahr:}  \\@trainyear  &  \\\\
  \\end{tabularx}
\\thispagestyle{fancy}
\\vspace{2em}}
\\makeatother\n
       "
       ;; Possibly limit depth for headline numbering.
       (let ((sec-num (plist-get info :section-numbers)))
         (when (integerp sec-num)
               (format "\\setcounter{secnumdepth}{%d}\n" sec-num)))
       ;; Author.
       (let ((author (and (plist-get info :with-author)
                                          (let ((auth (plist-get info :author)))
                                            (and auth (org-export-data auth info)))))
                 (email (and (plist-get info :with-email)
                                   (org-export-data (plist-get info :email) info))))
         (cond ((and author email (not (string= "" email)))
                    (format "\\author{%s\\thanks{%s}}\n" author email))
                   ((or author email) (format "\\author{%s}\n" (or author email)))))
       "\\trainyear{" trainyear "}\n"
       "\\trainno{" traino "}\n"
       "\\timeframe{" timeframe "}\n"
       "\\institute{" institute "}\n"
       ;; Date.
       ;; LaTeX displays today's date by default. One can override this by
       ;; inserting \date{} for no date, or \date{string} with any other
       ;; string to be displayed as the date.
       (let ((date (and (plist-get info :with-date) (org-export-get-date info))))
         (format "\\date{%s}\n" (org-export-data date info)))
       ;; Title and subtitle.
       (let* ((subtitle (plist-get info :subtitle))
                  (formatted-subtitle
                   (when subtitle
                     (format (plist-get info :latex-subtitle-format)
                                   (org-export-data subtitle info))))
                  (separate (plist-get info :latex-subtitle-separate)))
         (concat
              (format "\\title{%s%s}\n" title
                            (if separate "" (or formatted-subtitle "")))
              (when (and separate subtitle)
                (concat formatted-subtitle "\n"))))
       ;; Hyperref options.
       (let ((template (plist-get info :latex-hyperref-template)))
         (and (stringp template)
              (format-spec template spec)))
       ;; engrave-faces-latex preamble
       (when (and (eq (plist-get info :latex-src-block-backend) 'engraved)
                  (org-element-map (plist-get info :parse-tree)
                      '(src-block inline-src-block) #'identity
                      info t))
         (org-latex-generate-engraved-preamble info))
       ;; Document start.
       "\\begin{document}\n\n"
       ;; Title command.
       (let* ((title-command (plist-get info :latex-title-command))
              (command (and (stringp title-command)
                            (format-spec title-command spec))))
         (org-element-normalize-string
              (cond ((not (plist-get info :with-title)) nil)
                    ((string= "" title) nil)
                    ((not (stringp command)) nil)
                    ((string-match "\\(?:[^%]\\|^\\)%s" command)
                     (format command title))
                    (t command))))
       ;; Table of contents.
       (let ((depth (plist-get info :with-toc)))
         (when depth
               (concat (when (integerp depth)
                               (format "\\setcounter{tocdepth}{%d}\n" depth))
                             (plist-get info :latex-toc-command))))
       ;; Document's body.
       contents
       ;; Creator.
       (and (plist-get info :with-creator)
                (concat (plist-get info :creator) "\n"))
       "
\\vspace{1em}
 \\setlength\\extrarowheight{-3pt}
\\begin{tabularx}{\\textwidth}{X X}
    \\sigField{Auszubildender}{7.5cm}{2cm} & \\sigField{Ausbilder}{7.5cm}{2cm}  \\\\
\\hrulefill & \\hrulefill \\\\
Auszubildender & Ausbilder
\\end{tabularx}
"
       ;; Document end.
       "\\end{document}")))

  ;; Export commands
  (defun ausbildungsnachweis-export-as-latex (&optional async subtreep visible-only body-only ext-plist)
    "Export current buffer Org Ausbildungsnachweis to LaTeX buffer."
    (interactive)
    (org-export-to-buffer 'ausbildungsnachweis "*Org Ausbildungsnachweis Latex Export*"
      async subtreep visible-only body-only ext-plist
      (lambda () (LaTeX-mode))))

  (defun ausbildungsnachweis-export-to-latex (&optional async subtreep visible-only body-only ext-plist)
    "Export current buffer as Simple Memo LaTeX file."
    (interactive)
    (let ((outfile (org-export-output-file-name ".tex" subtreep)))
      (org-export-to-file 'ausbildungsnachweis outfile
        async subtreep visible-only body-only ext-plist)))

  (defun ausbildungsnachweis-export-to-pdf (&optional async subtreep visible-only body-only ext-plist)
    "Export current buffer as Simple Memo PDF file."
    (interactive)
    (let ((file (org-export-output-file-name ".tex" subtreep)))
      (org-export-to-file 'ausbildungsnachweis file
        async subtreep visible-only body-only ext-plist
        (lambda (file) (org-latex-compile file))))) )
