dot_config/emacs/init.el

(use-package org-noter
  :defer t
  :ensure t)

(use-package math-delimiters
  :ensure
  (:host github :repo "oantolin/math-delimiters")
  :config
  (with-eval-after-load 'org
    (define-key org-mode-map "$" #'math-delimiters-insert))
  (with-eval-after-load 'tex              ; for AUCTeX
    (define-key TeX-mode-map "$" #'math-delimiters-insert))
  (with-eval-after-load 'tex-mode         ; for the built-in TeX/LaTeX modes
    (define-key tex-mode-map "$" #'math-delimiters-insert))
  (with-eval-after-load 'cdlatex
    (define-key cdlatex-mode-map "$" nil)))

(use-package anki-editor
  :defer t
  :ensure
  (:host github :repo "anki-editor/anki-editor")
  :config
  (cl-defun slot/org-new-anki-node (&key type use-deck level)
  "Create a new anki node in any Org file.
If NAME is not specified, use a random 32-bit unsigned int for the
string.  If TYPE is \"Cloze\", insert a cloze deletion; if it is nil,
insert a \"Basic\" card template.  If USE-DECK is a string, use that
string as the deck name; otherwise, query the user.  LEVEL is the level
the headline should be set at; if this is nil, make a guess based on
'org-current-level'."
  (let ((lvl (or level
                 (max 1 (or (when (org-before-first-heading-p)
                              ;; If before any heading, default to level 1
                              1)
                            (progn (anki-editor--goto-nearest-note-type)
                                   (org-current-level))
                            0))))
        (type (or type "Basic"))
        (use-deck (when use-deck
                    (if (stringp use-deck)
                        use-deck
                      (completing-read "Deck: " (anki-editor-api-call-result 'deckNames))))))
    ;; Ensure we are at the correct point:
    (if (org-before-first-heading-p)
        (goto-char (point-max)) ;; Move to the end of the buffer if before first heading
      (if (org-at-heading-p)
          (org-end-of-subtree t t) ;; Move to the end of the current subtree if inside a heading
        (progn
          ;; Otherwise, go to the end of the last heading in the file
          (goto-char (point-max))
          (while (not (org-at-heading-p))
            (previous-line 1))
          (org-end-of-subtree t t)))) ;; Ensure insertion at the end of the last heading

    ;; Now insert the Anki node content
    (insert (concat (make-string lvl ?*) " " (int-to-string (cl-random (1- (expt 2 32))))))
    (insert (format "\n:PROPERTIES:%s\n:ANKI_NOTE_TYPE: %s\n:END:\n"
                    (if use-deck (format "\n:ANKI_DECK: %s" use-deck) "")
                    type))
    (if (string= type "Cloze")
        (insert (concat (make-string (1+ lvl) ?*) " Text"))
      (insert (concat (make-string (1+ lvl) ?*) " Front\n"))
      (insert (concat (make-string (1+ lvl) ?*) " Back\n"))
      (search-backward "Front"))
    (end-of-line)
    (newline)))

  (defun slot/org-new-anki-node-wrapper ()
    "Wrapper for `slot/org-new-anki-node' to make it callable interactively."
    (interactive)
    (slot/org-new-anki-node))

  ;; Key binding in anki-editor-mode-map
  :bind (:map anki-editor-mode-map
              ("C-c n" . slot/org-new-anki-node-wrapper)))

(use-package anki-editor-ui
  :ensure nil
  :defer t
  :after anki-editor
  :bind (:map anki-editor-mode-map
                    ("C-c e" . anki-editor-ui)))

(use-package auctex
  :defer t
  :ensure `(auctex :repo "https://git.savannah.gnu.org/git/auctex.git" :branch "main"
                   :pre-build (("make" "elpa"))
                   :build (:not elpaca--compile-info) ;; Make will take care of this step
                   :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
                   :version (lambda (_) (require 'auctex) AUCTeX-version))
  :config
  (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
        TeX-source-correlate-start-server t)

  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))

(use-package pdf-tools
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :magic ("%PDF" . pdf-view-mode)
  :defer t
  :ensure t
  :config
  (pdf-loader-install)
  (setq
   pdf-view-use-imagemagick nil)
  (defadvice! +pdf-suppress-large-file-prompts-a (fn size op-type filename &optional offer-raw)
              :around #'abort-if-file-too-large
              (unless (string-match-p "\\.pdf\\'" filename)
                (funcall fn size op-type filename offer-raw))))

(use-package saveplace-pdf-view
  :ensure t
  :after pdf-view)

(use-package sicp
  :ensure t
  :defer t)

(use-package markdown-mode
:ensure t
:mode ("README\\.md\\'" . gfm-mode)
:init (setq markdown-command "multimarkdown"))

(use-package transient
  :ensure t)
(use-package magit
  :ensure t
  :defer t
  :bind ("C-x g" . magit-status))

;; (use-package eglot-booster
;;   :ensure
;;   (eglot-booster :host github :repo "jdtsmith/eglot-booster")
;;    :after eglot
;;    :config
;;   (setq eglot-booster-io-only t)
;;   (eglot-booster-mode))

  (use-package breadcrumb
    :ensure t
    :hook (eglot-managed-mode . breadcrumb-local-mode))

(use-package eglot-java
  :ensure t
  :hook
  ((java-ts-mode java-mode) . eglot-java-mode)
  :bind (:map java-ts-mode-map
  ("C-c l n" . eglot-java-file-new)
  ("C-c l x" . eglot-java-run-main)
  ("C-c l t" . eglot-java-run-test)
  ("C-c l N" . eglot-java-project-new)
  ("C-c l T" . eglot-java-project-build-task)
  ("C-c l R" . eglot-java-project-build-refresh))
  :config
      ;; (setq eglot-java-server-install-dir (no-littering-expand-var-file-name "java/eclipse.jdt.ls/" ))
      ;; (setq eglot-java-eclipse-jdt-config-directory (no-littering-expand-var-file-name "java/eglot-java-eclipse-jdt-config/" ))
      ;; (setq eglot-java-eclipse-jdt-cache-directory (no-littering-expand-var-file-name "java/eglot-java-eclipse-jdt-cache/"))

  (setq eglot-java-user-init-opts-fn 'custom-eglot-java-init-opts)
(defun custom-eglot-java-init-opts ( &optional server eglot-java-eclipse-jdt)
  "Custom options that will be merged with any default settings."
  ;; :bundles ["/home/me/.emacs.d/lsp-bundles/com.microsoft.java.debug.plugin-0.50.0.jar"]
  `(:bundles [,(download-java-debug-plugin)]))

(defun download-java-debug-plugin ()
  (let ((cache-dir (expand-file-name "~/.cache/emacs/"))
        (url "https://repo1.maven.org/maven2/com/microsoft/java/com.microsoft.java.debug.plugin/maven-metadata.xml")
        (version nil)
        (jar-file-name nil)
        (jar-file nil))
    (unless (file-directory-p cache-dir)
      (make-directory cache-dir t))
    (setq jar-file (car (directory-files cache-dir nil "com\\.microsoft\\.java\\.debug\\.plugin-\\([0-9]+\\.[0-9]+\\.[0-9]+\\)\\.jar" t)))
    (if jar-file
        (expand-file-name jar-file cache-dir)
      (with-temp-buffer
        (url-insert-file-contents url)
        (when (re-search-forward "<latest>\\(.*?\\)</latest>" nil t)
          (setq version (match-string 1))
          (setq jar-file-name (format "com.microsoft.java.debug.plugin-%s.jar" version))
          (setq jar-file (expand-file-name jar-file-name cache-dir))
          (unless (file-exists-p jar-file)
            (setq url (format "https://repo1.maven.org/maven2/com/microsoft/java/com.microsoft.java.debug.plugin/%s/%s"
                              version jar-file-name))
            (message url)
            (url-copy-file url jar-file))
          jar-file)))))
  )
