dot_config/emacs/phil-emacs.org
*** DAP
#+begin_src emacs-lisp
  (use-package dape
    :ensure t
    :after eglot
    :config
      (setq dape-buffer-window-arrangement 'right)
    ;; (setq dape-buffer-window-arrangement 'gud)
    (setq dape-info-hide-mode-line nil)
    ;; Showing inlay hints
    ;; (setq dape-inlay-hints t)
    ;; Save buffers on startup, useful for interpreted languages
    ;; (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))
    ;; Kill compile buffer on build success
    ;; (add-hook 'dape-compile-hook 'kill-buffer)
    ;; (setq dape-cwd-function 'projectile-project-root)
  (add-to-list 'dape-configs
                 `(junit
                   modes (java-mode java-ts-mode)
                   ensure (lambda (config)
                            (save-excursion
                              (unless (eglot-current-server)
                                (user-error "No eglot instance active in buffer %s" (current-buffer)))
                              (when (equal ':json-false
                                           (eglot-execute-command
                                            (eglot-java--find-server)
                                            "java.project.isTestFile"
                                            (vector (eglot--path-to-uri (buffer-file-name)))))
                                (user-error "Not in a java test file"))
                              t))
                   fn (lambda (config)
                        (let ((file (expand-file-name (plist-get config :program)
                                                      (project-root (project-current)))))
                          (with-current-buffer (find-file-noselect file)
                            (save-excursion (eglot-java-run-test t))
                            (thread-first
                              config
                              (plist-put 'hostname "localhost")
                              (plist-put 'port (eglot-execute-command (eglot-current-server)
                                                                      "vscode.java.startDebugSession" nil))
                              (plist-put :projectName (project-name (project-current)))))))
                   :program dape-buffer-default
                   :request "attach"
                   :hostname "localhost"
                   :port 8000))


    )

  (use-package repeat
    :config
    (repeat-mode))
#+end_src
*** Python
#+begin_src emacs-lisp
  (use-package python-isort
    :ensure t)

  (use-package ruff-format
    :ensure t)

  ;; (use-package flymake-ruff
  ;;   :ensure t
  ;;   :hook (eglot-managed-mode . flymake-ruff-load))

  ;; (use-package py-vterm-interaction
  ;;   :ensure t
  ;;   :config
  ;;   (setq py-vterm-interaction-repl-program "ipython")
  ;;   (setq py-vterm-interaction-silent-cells t))

  (use-package pet
    :ensure t
    :config
    (add-hook 'python-ts-mode-hook
              (lambda ()
                ;; (setq-local python-shell-interpreter (pet-executable-find "ipython")
                ;;             python-shell-virtualenv-root (pet-virtualenv-root)
                ;;             python-shell-interpreter-args "-i --simple-prompt")

                (setq-local py-vterm-interaction-repl-program (pet-executable-find "ipython")
                            py-vterm-interaction-context (pet-virtualenv-root)
                            py-vterm-interaction-silent-cells t)
                (py-vterm-interaction-mode)
                (pet-eglot-setup)

                (eglot-ensure)

                (when-let ((ruff-executable (pet-executable-find "ruff")))
                  (setq-local ruff-format-command ruff-executable)
                  (ruff-format-on-save-mode))
                (when-let ((isort-executable (pet-executable-find "isort")))
                  (setq-local python-isort-command isort-executable)
                  (python-isort-on-save-mode)))))
#+end_src
*** Julia
#+begin_src emacs-lisp
  (use-package julia-ts-mode
    :ensure t
    :mode "\\.jl$")


  (use-package eglot-jl
    :ensure t
    :hook (julia-ts-mode . (lambda ()
                             (eglot-jl-init)
                             (eglot-ensure))))

  (use-package julia-snail
    :ensure t
    :hook (julia-ts-mode . julia-snail-mode)
    :custom
    (julia-snail-extensions '(debug))) ;;
#+end_src
*** Scheme
#+begin_src emacs-lisp
    (use-package geiser-mit
      :ensure t
      :defer t)
#+end_src
** Sly
#+begin_src emacs-lisp
      (use-package sly
        :ensure t
        :defer t)
#+end_src
** Flymake
#+begin_src emacs-lisp
  (use-package flymake-flycheck
    :ensure t
    :defer t)

  (with-eval-after-load 'flymake
    ;; Provide some flycheck-like bindings in flymake mode to ease transition
    (define-key flymake-mode-map (kbd "C-c ! l") 'flymake-show-buffer-diagnostics)
    (define-key flymake-mode-map (kbd "C-c ! n") 'flymake-goto-next-error)
    (define-key flymake-mode-map (kbd "C-c ! p") 'flymake-goto-prev-error)
    (define-key flymake-mode-map (kbd "C-c ! c") 'flymake-start))
#+end_src
** Spellcheck
*** Jinx
#+begin_src emacs-lisp
  (use-package jinx
  :defer t
  :ensure t
  :bind-keymap (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages)))
#+end_src
*** Language Tool
#+begin_src emacs-lisp
  (use-package langtool
    :ensure t
    :init
    (setq langtool-java-classpath
      "/usr/share/languagetool:/usr/share/java/languagetool/*")
    :commands
    (langtool-check))
  ;; (use-package flymake-languagetool
  ;;   :ensure t
  ;;   :defer t
  ;;   :hook (org-mode . flymake-languagetool-load)
  ;;   :init
  ;;   (setq flymake-languagetool-server-jar "~/.local/bin/LanguageTool-6.5/languagetool-server.jar"))
#+end_src
** Mail
#+begin_src emacs-lisp :tangle no
      (use-package message
        :ensure nil
        :custom
        (message-send-mail-function 'smtpmail-send-it)

        (message-server-alist '(("philipp-kober@mailbox.org"
                                 . "smtp smtp.mailbox.org 587 philipp-kober@mailbox.org")
                                ("philipp.kober@uni-koeln.de"
                                 . "smtp  smtp-auth.uni-koeln.de 587 preyher"))))


  (use-package gnus
    :ensure nil
    :custom
    (gnus-select-method '(nnnil nil))
    (gnus-secondary-select-methods '((nnimap "Mailbox"
                                             (nnimap-address "imap.mailbox.org")
                                             (nnimap-server-port "imaps")
                                             (nnimap-inbox "INBOX")
                                             (nnimap-user "philipp.kober@mailbox.org")
                                             (nnimap-stream ssl))
                                     (nnimap "Uni Köln"
                                             (nnimap-address "imap.uni-koeln.de")
                                             (nnimap-server-port "imaps")
                                             (nnimap-inbox "INBOX")
                                             (nnimap-user "preyher")
                                             (nnimap-stream ssl))))

    (gnus-posting-styles '((".*"
                            (address "Philipp Kober <philipp.kober@mailbox.org>"))
                           ("Uni Köln"
                            (address "Philipp Kober <philipp.kober@uni-koeln.de>")))))

  (use-package auth-source
    :ensure nil
    :config
    (setq auth-sources '(password-store))
    (setq auth-source-debug 'trivia))
#+end_src
* Reset Garbage Collection and Elpaca init hook
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 4 1000 1000))
  ;;END OF INIT FILE
  (setq elpaca-after-init-time (or elpaca-after-init-time (current-time)))
  (elpaca-wait)
#+end_src
